{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "df301a7f",
   "metadata": {},
   "source": [
    "Анастасия инвестировала 100 долларов под простые 10 %. Другими словами, ежегодно инвестиция должна приносить 10 % инвестированной суммы, т.е. 10 долларов каждый год: прибыль = 0,10 x исходный баланс.\n",
    "\n",
    "В то же время Екатерина инвестировала 100 долларов под сложные 5 %. Это значит, что прибыль составит 5 % от текущего баланса, включая предыдущую накопленную прибыль: прибыль = 0,05 х текущий баланс. Екатерина зарабатывает 5 % от 100 долларов в первый год, что дает ей 105 долларов. На следующий год она зарабатывает 5 % от 105 долларов, что составляет 5.25 долларов, и т.д.\n",
    "\n",
    "**Напишите программу, которая вычислит, сколько лет понадобится для того, чтобы сумма баланса Екатерины превысила сумму баланса Анастасии, с отображением значений обоих балансов за каждый год.**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 192,
   "id": "411f7bce",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Баланс Анастасии в 1 год: 110\n",
      "Баланс Екатерины в 1 год: 105\n",
      "Баланс Анастасии в 2 год: 120\n",
      "Баланс Екатерины в 2 год: 110\n",
      "Баланс Анастасии в 3 год: 130\n",
      "Баланс Екатерины в 3 год: 115\n",
      "Баланс Анастасии в 4 год: 140\n",
      "Баланс Екатерины в 4 год: 121\n",
      "Баланс Анастасии в 5 год: 150\n",
      "Баланс Екатерины в 5 год: 127\n",
      "Баланс Анастасии в 6 год: 160\n",
      "Баланс Екатерины в 6 год: 134\n",
      "Баланс Анастасии в 7 год: 170\n",
      "Баланс Екатерины в 7 год: 140\n",
      "Баланс Анастасии в 8 год: 180\n",
      "Баланс Екатерины в 8 год: 147\n",
      "Баланс Анастасии в 9 год: 190\n",
      "Баланс Екатерины в 9 год: 155\n",
      "Баланс Анастасии в 10 год: 200\n",
      "Баланс Екатерины в 10 год: 162\n",
      "Баланс Анастасии в 11 год: 210\n",
      "Баланс Екатерины в 11 год: 171\n",
      "Баланс Анастасии в 12 год: 220\n",
      "Баланс Екатерины в 12 год: 179\n",
      "Баланс Анастасии в 13 год: 229\n",
      "Баланс Екатерины в 13 год: 188\n",
      "Баланс Анастасии в 14 год: 240\n",
      "Баланс Екатерины в 14 год: 197\n",
      "Баланс Анастасии в 15 год: 250\n",
      "Баланс Екатерины в 15 год: 207\n",
      "Баланс Анастасии в 16 год: 260\n",
      "Баланс Екатерины в 16 год: 218\n",
      "Баланс Анастасии в 17 год: 270\n",
      "Баланс Екатерины в 17 год: 229\n",
      "Баланс Анастасии в 18 год: 280\n",
      "Баланс Екатерины в 18 год: 240\n",
      "Баланс Анастасии в 19 год: 290\n",
      "Баланс Екатерины в 19 год: 252\n",
      "Баланс Анастасии в 20 год: 300\n",
      "Баланс Екатерины в 20 год: 265\n",
      "Баланс Анастасии в 21 год: 310\n",
      "Баланс Екатерины в 21 год: 278\n",
      "Баланс Анастасии в 22 год: 320\n",
      "Баланс Екатерины в 22 год: 292\n",
      "Баланс Анастасии в 23 год: 330\n",
      "Баланс Екатерины в 23 год: 307\n",
      "Баланс Анастасии в 24 год: 340\n",
      "Баланс Екатерины в 24 год: 322\n",
      "Баланс Анастасии в 25 год: 350\n",
      "Баланс Екатерины в 25 год: 338\n",
      "Баланс Анастасии в 26 год: 360\n",
      "Баланс Екатерины в 26 год: 355\n",
      "Екатерина догонит Анастасию за 27 лет\n",
      "Итоговый баланс Екатерины — 373\n",
      "Итоговый баланс Анастасии — 370\n"
     ]
    }
   ],
   "source": [
    "i = 1\n",
    "\n",
    "while (100 * ((1+0.05*1)**i)) < (100 * (1 + i*0.1)):    \n",
    "    print ('Баланс Анастасии в', i, 'год:', int((100 * (1 + i*0.1))))\n",
    "    print ('Баланс Екатерины в', i, 'год:', int((100 * ((1+0.05*1)**i))))\n",
    "    i += 1\n",
    "else:\n",
    "    print ('Екатерина догонит Анастасию за', i, 'лет')\n",
    "    print ('Итоговый баланс Екатерины —', int((100 * ((1+0.05*1)**i))))\n",
    "    print ('Итоговый баланс Анастасии —', int((100 * (1 + i*0.1))))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
